app/controllers/kits_controller.rb

  def show
    @kit = Kit.find(params[:id])
---
SELECT * FROM "kits" WHERE ("kits"."id" = 9)